# Python 入门
'''
1.1 常用注释
    1、# 表示单行注释
1.2 标识符
    Python 的命名规则：
        第一字母为字母或下划线，
        除第一个字符意外的其他字符可以是字母、下划线或字符

1.3 数据类型
    数，字符串，列表(list)，元组(tuple)，集合(set)，字典(dictionary)
'''

# 数
abc = 9

# 字符串
# 单引号，双引号都是字符串
a = 'haha'
b = "haha"
c = '''haha'''

# 列表(存储多个元素, 列表中的元素可以重新赋值, 最外围用[]中括号表示)
b = [7, 8, "abc", 9]
#print(b[0])

# 元组 (存储多个元素, 元组中的元素不可以重新赋值, 最外围用()小括号表示)
c = (7, 8, "abc", 9)
#print(c)

# 字典 {键: 值, 键: 值, ...} java中的Map
d = {"name": "gaoyaqiu", "sex": "boy", "job": "程序猿"}
#print(d["sex"])

# 集合 (用的不多,最好的用处就是去重,)
# 去重 (比如下面的例子中a比较多,使用集合之后,重复的a都会过滤掉只保留一个)
e1 = set('''abcdefgaaaa''')
e2 = set('''abcdf''')
#print(e1)

# 交集
r1 = e1 & e2
#print(r1)

# 并集
r2 = e1 | e2
#print(r2)

# 差集
r3 = e1 - e2
#print(r3)

# 对称差集
r4 = e1 ^ e2
#print(r4)

# 1.4 运算符 (常见的有+、-、*、/、%号等)
h1 = 1 + 8 * 2 - 1
#print(h1)

h2 = (1 + 8) * 2 - 1
#print(h2)

h3 = 21 % 2
#print(h3)

# + 号也可以做为字符串连接使用
o1 = "hello "
o2 = o1 + "python"
#print(o2)

# 1.5 缩进
# python 是一门强制缩进的语言,这一点的存在,
# 让python代码变得更加美观。python中缩进规律:
# 同一层的代码,处于同一个缩进幅度上,下一层代码,需要相对于上一个层次的代码进行缩进
# 建议使用tab键进行缩进

b = "10"
if(b == "10"):
    print("abc")




